In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("aug_train.csv")

# Size of Data

In [8]:
df.shape

(19158, 14)

# How data look like

In [12]:
df.sample(5)

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
11221,25600,city_102,0.804,NaN,Has relevent experience,no_enrollment,Graduate,STEM,10,50-99,Pvt Ltd,4,83,0.0
12547,30909,city_16,0.910,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,>4,146,1.0
10240,30625,city_74,0.579,Male,Has relevent experience,Full time course,Graduate,No Major,2,50-99,Pvt Ltd,1,4,1.0
11218,23655,city_21,0.624,NaN,Has relevent experience,no_enrollment,Graduate,STEM,10,100-500,Pvt Ltd,2,56,0.0
25,14505,city_67,0.855,NaN,No relevent experience,no_enrollment,High School,NaN,4,NaN,NaN,never,22,0.0

# Data types

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19158 entries, 0 to 19157
Data columns (total 14 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   enrollee_id             19158 non-null  int64
 1   city                    19158 non-null  object
 2   city_development_index  19158 non-null  float64
 3   gender                  14650 non-null  object
 4   relevent_experience     19158 non-null  object
 5   enrolled_university     18772 non-null  object
 6   education_level         18698 non-null  object
 7   major_discipline        16345 non-null  object
 8   experience              19093 non-null  object
 9   company_size            13220 non-null  object
 10  company_type            13018 non-null  object
 11  last_new_job            18735 non-null  object
 12  training_hours          19158 non-null  int64
 13  target                  19158 non-null  float64
dtypes: float64(2), int64(2), object(10)
memory usage: 2.0+ MB

# Any missing values

In [18]:
df.isnull().sum()

enrollee_id                  0
city                         0
city_development_index       0
gender                    4508
relevent_experience          0
enrolled_university        386
education_level            460
major_discipline          2813
experience                  65
company_size              5938
company_type              6140
last_new_job               423
training_hours               0
target                       0
dtype: int64

# Data look mathematically

In [21]:
df.describe()

        enrollee_id  city_development_index  training_hours        target
count  19158.000000            19158.000000    19158.000000  19158.000000
mean   16875.358179                0.828848       65.366896      0.249348
std     9616.292592                0.123362       60.058462      0.432647
min        1.000000                0.448000        1.000000      0.000000
25%     8554.250000                0.740000       23.000000      0.000000
50%    16982.500000                0.903000       47.000000      0.000000
75%    25169.750000                0.920000       88.000000      0.000000
max    33380.000000                0.949000      336.000000      1.000000

# duplicate values

In [30]:
df.duplicated().sum()

0

# Correlation between columns

In [ ]:
df.corr()